# 《高级语言程序设计(C++语言)》实验报告

| 项目 | 内容 | 项目 | 内容 |
| :--- | :--- | :--- | :--- |
| **实验名称** | 第一次上机课实验 | **实验日期** | 2026年10月23日 |
| **实验地点** | 于刚宋晓楼A237 | **学号** | 2026302192042
| **专业** | 人工智能专业 | **指导老师** | 胡黔楠 |

---

## 一、实验目的
1. 掌握 C++ 的基本语法
2. 熟悉C++的分支，循环等基本语法

## 二、实验环境
- **操作系统**：Windows 11
- **开发工具**：Visual Studio Code
- **编程语言**：C++

## 三、实验过程及结果

### 题目1：企业奖金提成计算

**解答：代码**
#include <iostream>
using namespace std;

int main()
{
    double I, bonus;

    cout << "Input profit I (yuan): ";
    cin >> I;

    if (I <= 0)
        bonus = 0;
    else if (I <= 100000)
        bonus = I * 0.10;
    else if (I <= 200000)
        bonus = 100000 * 0.10 + (I - 100000) * 0.075;
    else if (I <= 400000)
        bonus = 100000 * 0.10 + 100000 * 0.075 + (I - 200000) * 0.05;
    else if (I <= 600000)
        bonus = 100000 * 0.10 + 100000 * 0.075 + 200000 * 0.05 + (I - 400000) * 0.03;
    else if (I <= 1000000)
        bonus = 100000 * 0.10 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (I - 600000) * 0.015;
    else
        bonus = 100000 * 0.10 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (I - 1000000) * 0.01;

    cout << "Bonus = " << bonus << " yuan" << endl;

    return 0;
}
 



![题目1运行结果]()

### 题目2：电影打分评语

**解答：代码**
```cpp

![题目2运行结果]()

### 题目3：判断回文数

**解答：代码**
```cpp



![题目3运行结果]()

### 题目4：三位水仙花数

**解答：代码**
```cpp



![题目4运行结果]()

### 题目5：数列 a, aa, aaa... 求和

**解答：代码**
```cpp




![题目5运行结果]()

### 题目6：乘法口诀表

**解答：代码**
```cpp




![题目6运行结果]()
### 题目7：兔子数量

**解答：代码**
```cpp


![题目7运行结果]()

### 题目8：猴子吃桃

**解答：代码**
```cpp

![题目8运行结果]()

实验总结：
